app/controllers/comments_controller.rb

  def show
    max_per_page = 2
    paginate @post.comments.count, max_per_page do |limit, offset|
      render json: @post.comments.limit(limit).offset(offset)
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 30]]
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? LIMIT 2 OFFSET 0  [["post_id", 30]]

  def create
    post = Post.find(params[:post_id])
    p '32222222222'
    comment = Comment.new(comment_params.merge(user_id: current_user.id))
    p comment
    if comment.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 30]]
INSERT INTO "comments" ("body", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "dsa"], ["post_id", 30], ["user_id", 11], ["created_at", "2016-09-14 16:44:49.638628"], ["updated_at", "2016-09-14 16:44:49.638628"]]