app/controllers/posts_controller.rb

  def index
    max_per_page = 2
    paginate Post.order("created_at DESC").count, max_per_page do |limit, offset|
      render json: Post.order("created_at DESC").limit(limit).offset(offset)
---
SELECT COUNT(*) FROM "posts"
SELECT  "posts".* FROM "posts"  ORDER BY created_at DESC LIMIT 2 OFFSET 0

  def show
    render json: Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 30]]

  def create
    rubrics = []
    rubric_ids = post_params[:rubric_ids]
    unless post_params[:body]&&post_params[:title]
      p = Post.create(post_params)
      render json: p.errors
      return;
    end
    unless rubric_ids
      render json: Rubric.create().errors
      return;
    end
    rubric_ids.each {|id| rubrics.push(Rubric.find(id)) }
---
INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "cadslca"], ["body", "cds"], ["user_id", 12], ["created_at", "2016-09-24 16:17:34.714177"], ["updated_at", "2016-09-24 16:17:34.714177"]]
SELECT  "rubrics".* FROM "rubrics" WHERE "rubrics"."id" = ? LIMIT 1  [["id", 1]]