app/controllers/rubrics_controller.rb

  def index
    respond_with Rubric.all
---
SELECT "rubrics".* FROM "rubrics"

  def show
    rubric = Rubric.find(params[:id])
    posts = rubric.posts.order("created_at DESC")
    max_per_page = 2
    paginate posts.count, max_per_page do |limit, offset|
      render json: posts.limit(limit).offset(offset)
---
SELECT  "rubrics".* FROM "rubrics" WHERE "rubrics"."id" = ? LIMIT 1  [["id", 3]]
SELECT COUNT(*) FROM "posts" INNER JOIN "posts_rubrics" ON "posts"."id" = "posts_rubrics"."post_id" WHERE "posts_rubrics"."rubric_id" = ?  [["rubric_id", 3]]
SELECT  "posts".* FROM "posts" INNER JOIN "posts_rubrics" ON "posts"."id" = "posts_rubrics"."post_id" WHERE "posts_rubrics"."rubric_id" = ?  ORDER BY created_at DESC LIMIT 2 OFFSET 0  [["rubric_id", 3]]

  def name
    rubric = Rubric.find(params[:id])
---
SELECT  "rubrics".* FROM "rubrics" WHERE "rubrics"."id" = ? LIMIT 1  [["id", 3]]